backend/tests/Stress_Test_Results/stress_test.log
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 173.254.41.118 (be patient).....done


Server Software:        Apache
Server Hostname:        173.254.41.118
Server Port:            80

Document Path:          /leon/prototype_for_Common/facebook_friends.php
Document Length:        4013 bytes

Concurrency Level:      5
Time taken for tests:   2.176 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Non-2xx responses:      10
Total transferred:      46490 bytes
HTML transferred:       40130 bytes
Requests per second:    4.60 [#/sec] (mean)
Time per request:       1088.062 [ms] (mean)
Time per request:       217.613 [ms] (mean, across all concurrent requests)
Transfer rate:          20.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      185  187   1.2    187     189
Processing:   270  600 206.2    748     750
Waiting:      265  486 175.9    561     748
Total:        456  786 206.2    934     937

Percentage of the requests served within a certain time (ms)
  50%    934
  66%    934
  75%    935
  80%    936
  90%    937
  95%    937
  98%    937
  99%    937
 100%    937 (longest request)