backend/tests/Stress_Test_Results/stress_test_apache.log
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Apache/2.4.4
Server Hostname:        localhost
Server Port:            80

Document Path:          /test_rest/index.php
Document Length:        14556 bytes

Concurrency Level:      100
Time taken for tests:   4.705 seconds
Complete requests:      100
Failed requests:        91
   (Connect: 0, Receive: 0, Length: 91, Exceptions: 0)
Write errors:           0
Total transferred:      383945 bytes
HTML transferred:       365745 bytes
Requests per second:    21.25 [#/sec] (mean)
Time per request:       4705.270 [ms] (mean)
Time per request:       47.053 [ms] (mean, across all concurrent requests)
Transfer rate:          79.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       3
Processing:   386 3590 1578.0   4453    4695
Waiting:      385 3590 1578.0   4452    4695
Total:        386 3590 1577.9   4453    4695

Percentage of the requests served within a certain time (ms)
  50%   4453
  66%   4482
  75%   4494
  80%   4505
  90%   4655
  95%   4682
  98%   4687
  99%   4695
 100%   4695 (longest request)